DesignIV-Equipe4/EchoLink/STM32CubeIDE/EchoLink/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RS232_INV_Pin GPIO_PIN_13
#define RS232_INV_GPIO_Port GPIOC
#define BT_IO1_Pin GPIO_PIN_0
#define BT_IO1_GPIO_Port GPIOA
#define LORA_INT_Pin GPIO_PIN_2
#define LORA_INT_GPIO_Port GPIOA
#define LORA_nRST_Pin GPIO_PIN_3
#define LORA_nRST_GPIO_Port GPIOA
#define LORA_SPI1_NSS_Pin GPIO_PIN_4
#define LORA_SPI1_NSS_GPIO_Port GPIOA
#define LORA_SPI1_SCK_Pin GPIO_PIN_5
#define LORA_SPI1_SCK_GPIO_Port GPIOA
#define LORA_SPI1_MISO_Pin GPIO_PIN_6
#define LORA_SPI1_MISO_GPIO_Port GPIOA
#define LORA_SPI1_MOSI_Pin GPIO_PIN_7
#define LORA_SPI1_MOSI_GPIO_Port GPIOA
#define LORA_RXEN_Pin GPIO_PIN_0
#define LORA_RXEN_GPIO_Port GPIOB
#define LORA_BUSY_Pin GPIO_PIN_1
#define LORA_BUSY_GPIO_Port GPIOB
#define BT_LPUART1_RX_Pin GPIO_PIN_10
#define BT_LPUART1_RX_GPIO_Port GPIOB
#define BT_LPUART1_TX_Pin GPIO_PIN_11
#define BT_LPUART1_TX_GPIO_Port GPIOB
#define BT_LPUART1_RTS_Pin GPIO_PIN_12
#define BT_LPUART1_RTS_GPIO_Port GPIOB
#define BT_LPUART1_CTS_Pin GPIO_PIN_13
#define BT_LPUART1_CTS_GPIO_Port GPIOB
#define BT_nSYSKEY_Pin GPIO_PIN_14
#define BT_nSYSKEY_GPIO_Port GPIOB
#define BT_IO2_Pin GPIO_PIN_15
#define BT_IO2_GPIO_Port GPIOB
#define PWR_LPTIM2_OUT_Pin GPIO_PIN_8
#define PWR_LPTIM2_OUT_GPIO_Port GPIOA
#define SYS_SWDIO_Pin GPIO_PIN_13
#define SYS_SWDIO_GPIO_Port GPIOA
#define SYS_SWCLK_Pin GPIO_PIN_14
#define SYS_SWCLK_GPIO_Port GPIOA
#define SYS_SWO_Pin GPIO_PIN_3
#define SYS_SWO_GPIO_Port GPIOB
#define RS232_EN_Pin GPIO_PIN_5
#define RS232_EN_GPIO_Port GPIOB
#define RS232_UART1_TX_Pin GPIO_PIN_6
#define RS232_UART1_TX_GPIO_Port GPIOB
#define RS232_UART1_RX_Pin GPIO_PIN_7
#define RS232_UART1_RX_GPIO_Port GPIOB
#define MOD_0_Pin GPIO_PIN_9
#define MOD_0_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
